InformationRegisters/РазмерыЛьготИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РазмерыЛьготИПН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КатегорияЛицаПолучателяЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЛицПолучателейЛьготИПН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РазмерыЛьготИПН/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура НачальноеЗаполнение () Экспорт
	
	ЗаполнитьРазмерыЛьготИПН();
	
КонецПроцедуры

Процедура ЗаполнитьРазмерыЛьготИПН() Экспорт
	
	НаборЗаписей = РегистрыСведений.РазмерыЛьготИПН.СоздатьНаборЗаписей();

	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20100101', "", 55);
	ДобавитьРазмерЛьготИПН(НаборЗаписей, '20170101', "", 75);
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьРазмерЛьготИПН(НаборЗаписей, Период, КатегорияЛицаПолучателяЛьготы, РазмерЛьготы)
	
   	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Период = Период;  
	НоваяЗапись.КатегорияЛицаПолучателяЛьготы = КатегорияЛицаПолучателяЛьготы;
	НоваяЗапись.Размер = РазмерЛьготы;
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
